prompts_by_key = {
    'Ambient': ["Эмбиент", "В стиле эмбиент", "Атмосферная музыка", "Фоновая музыка"],
    'Atonal': ["Атональная музыка", "Атональность", "Без определенной тональности"],
    'Baroque': ["Барокко", "Стиль барокко", "Эпоха барокко", "Барочная музыка"],
    'Blues': ["Блюз", "В стиле блюз", "Блюзовая композиция", "Ритм блюза"],
    'Classical': ["Классика", "Классическая музыка", "Академическая музыка", "Классический стиль"],
    'Contemporary': ["Контемпорари", "Современная академическая музыка", "Авангард", "Современный стиль"],
    'Folk': ["Фолк", "Народная музыка", "Фольклорный стиль", "Народные мотивы"],
    'Impressionist': ["Импрессионизм", "Стиль импрессионизм", "Музыкальный импрессионизм"],
    'Jazz': ["Джаз", "Джазовая музыка", "В джазовом стиле", "Джазовая импровизация"],
    'Modern': ["Модерн", "Эпоха модерна", "Модернизм", "Стиль модерн"],
    'Pop': ["Поп", "Поп-музыка", "Популярная музыка", "Эстрадная музыка"],
    'Rag': ["Рэг", "В стиле рэг"],
    'Ragtime': ["Рэгтайм", "Стиль рэгтайм", "Ритмы рэгтайма"],
    'Rock': ["Рок", "Рок-музыка", "В стиле рок", "Рок-композиция"],
    'Romantic': ["Романтизм", "Эпоха романтизма", "Романтическая музыка", "Стиль романтизм"],
    'Soundtrack': ["Саундтрек", "Музыка из фильма", "Кинематографичная музыка", "OST"],
    'Expressive': ["Экспрессивная музыка", "Выразительное исполнение", "Эмоциональный стиль"],
    'Piano': ["Фортепианная музыка", "Для фортепиано", "Клавишная музыка"],
    'Performances': ["Живое исполнение", "Запись исполнения", "Перформанс"],
    'Sinfonia': ["Синфония", "Синфоническая музыка"],
    'Moments musicaux': ["Музыкальные моменты", "Цикл пьес", "Музыкальный момент"],
    'English Suite': ["Английская сюита", "Сюита в английском стиле"],
    'Courante': ["Куранта", "Танец куранта"],
    'Passepied': ["Паспье", "Танец паспье"],
    'Schottische': ["Шоттиш", "Танец шоттиш"],
    'Mélodie': ["Мелодия", "Мелодичная пьеса"],

     #forms
    'Bagatelle': ["Багатель", "Маленькая пьеса", "Легкая пьеса"],
    'Ballade': ["Баллада", "Жанр баллады", "Фортепианная баллада"],
    'Barcarolle': ["Баркарола", "Песня лодочника", "В ритме баркаролы"],
    'Canon': ["Канон", "Каноническая форма", "Полифонический канон"],
    'Concerto': ["Концерт", "Фортепианный концерт", "Концерт для фортепиано"],
    'Etude': ["Этюд", "Технический этюд", "Упражнение", "Концертный этюд"],
    'Fantasia': ["Фантазия", "Свободная форма", "Музыкальная фантазия"],
    'Fugue': ["Фуга", "Полифоническая фуга", "Строгая фуга"],
    'Hymn': ["Гимн", "Торжественный гимн", "Церковный гимн"],
    'Impromptu': ["Экспромт", "Музыкальный экспромт", "Импровизационная пьеса"],
    'Intermezzo': ["Интермеццо", "Промежуточная пьеса", "Вставка"],
    'Invention': ["Инвенция", "Двухголосная инвенция", "Трехголосная инвенция"],
    'Legend': ["Легенда", "Музыкальная легенда", "Сказание"],
    'March': ["Марш", "Маршевый ритм", "Торжественный марш"],
    'Mazurka': ["Мазурка", "Польский танец", "В ритме мазурки"],
    'Medley': ["Попурри", "Смесь мелодий", "Музыкальная подборка"],
    'Minuet': ["Менуэт", "Старинный танец", "Танец менуэт"],
    'Nocturne': ["Ноктюрн", "Ночная музыка", "Лирическая пьеса"],
    'Partita': ["Партита", "Циклическая форма", "Сюита"],
    'Piano Sonata': ["Фортепианная соната", "Соната для фортепиано", "Сонатная форма"],
    'Piano_Sonatas': ["Фортепианные сонаты", "Сонаты для пианино"],
    'Polonaise': ["Полонез", "Торжественный танец", "Польский полонез"],
    'Prelude': ["Прелюдия", "Вступление", "Цикл прелюдий"],
    'Prelude And Fugue': ["Прелюдия и фуга", "Полифонический цикл"],
    'Rhapsody': ["Рапсодия", "Свободная композиция", "Эпическая пьеса"],
    'Romance': ["Романс", "Лирический романс", "Песня без слов"],
    'Rondo': ["Рондо", "Форма рондо", "Круговая форма"],
    'Scherzo': ["Скерцо", "Шутка", "Быстрая пьеса"],
    'Sonata': ["Соната", "Сонатная форма", "Классическая соната"],
    'Sonatas': ["Сонаты", "Цикл сонат"],
    'Sonatina': ["Сонатина", "Маленькая соната", "Легкая соната"],
    'Sonatine': ["Сонатина", "Простая соната"],
    'Suite': ["Сюита", "Набор пьес", "Танцевальная сюита"],
    'Toccata': ["Токката", "Виртуозная пьеса", "Токкатный стиль"],
    'Valse': ["Вальс", "Французский вальс", "Танец вальс"],
    'Variation': ["Вариация", "Вариационная форма", "Тема с вариациями"],
    'Variations': ["Вариации", "Цикл вариаций", "Разработка темы"],
    'Waltz': ["Вальс", "В ритме вальса", "Кружащийся танец"],

    #technical_and_level
    'Advanced': ["Продвинутый уровень", "Для опытных пианистов", "Высокая сложность", "Трудно для исполнения"],
    'Arrangement': ["Аранжировка", "Обработка", "Переложение для фортепиано"],
    'Beginner': ["Для начинающих", "Легкий уровень", "Простая пьеса", "Для обучения"],
    'Cover': ["Кавер", "Кавер-версия", "Современная обработка"],
    'Largo': ["Темп Ларго", "Очень медленно", "Широко"],
    'Allegro': ["Темп Аллегро", "Скоро", "Быстро", "Жизнерадостно"],
    'I.': ["Первая часть", "Часть I", "Начало", 'I.'],
    'II.': ["Вторая часть", "Часть II", "Середина", 'II.'],
    'III.': ["Третья часть", "Часть III", 'III.'],
    'IV.': ["Четвертая часть", "Часть IV", "Финал", 'IV.'],
    'assai': ["Весьма", "Очень", "Достаточно"],
    'con brio': ["С огнем", "С жаром", "Блестяще"],
    'cantabile': ["Певуче", "Как песня", "Мелодично"],
    'Adagio': ["Темп Адажио", "Медленно", "Спокойно"],
    'Andante': ["Темп Анданте", "Не спеша", "Шагом"],
    'moto': ["С движением", "Подвижно"],
    'Rondo.': ["В форме рондо", "Финал-рондо"],
    'Improvisation': ["Импровизация", "Свободное исполнение", "Джазовая импровизация"],
    'Intermediate': ["Средний уровень", "Средняя сложность", "Для продолжающих"],
    'Solo': ["Соло", "Одиночное исполнение", "Без аккомпанемента"],
    'Solo Piano': ["Фортепиано соло", "Только рояль", "Один инструмент"],
    'Virtuoso': ["Виртуозное произведение", "Высшее мастерство", "Технически сложно"],
    'Prestissimo': ["Престиссимо", "Предельно быстро", "Очень быстрый темп"],
    'Molto allegro': ["Молто аллегро", "Очень скоро", "Крайне оживленно"],
    'Allegretto': ["Аллегретто", "Умеренно скоро", "Грациозно"],
    'Andantino': ["Андантино", "Подвижнее, чем анданте"],
    'Lento': ["Ленто", "Протяжно", "Медленно"],
    'Moderato': ["Модерато", "Умеренный темп", "Сдержанно"],
    'Grave': ["Граве", "Тяжело", "Торжественно и медленно"],
    'Pathetique': ["Патетическая", "Патетический характер", "Возвышенно"],
    'Appassionata': ["Аппассионата", "Страстно", "Взволнованно"],
    'Pastorale': ["Пастораль", "Пасторальный характер", "Сельские мотивы"],
    'Waldstein': ["Вальдштейн", "Соната Вальдштейна"],
    'Eroica': ["Героическая", "Героический стиль"],
    'Live': ["Живая запись", "Концертное исполнение", "Запись с концерта"],
    'Swing': ["Свинг", "Свинговый ритм", "В ритме свинга"],

    #Тональности
    'C':  ['C', "До мажор", "в тональности До мажор", "C Major"],
    'C#': ['C#', "До-диез мажор", "в тональности До-диез мажор", "C-Sharp Major"],
    'Db': ['Db', "Ре-бемоль мажор", "в тональности Ре-бемоль мажор", "D-Flat Major"],
    'D':  ['D', "Ре мажор", "в тональности Ре мажор", "D Major"],
    'D#': ['D#', "Ре-диез мажор", "в тональности Ре-диез мажор", "D-Sharp Major"],
    'Eb': ['Eb', "Ми-бемоль мажор", "в тональности Ми-бемоль мажор", "E-Flat Major"],
    'E':  ['E', "Ми мажор", "в тональности Ми мажор", "E Major"],
    'F':  ['F', "Фа мажор", "в тональности Фа мажор", "F Major"],
    'F#': ['F#', "Фа-диез мажор", "в тональности Фа-диез мажор", "F-Sharp Major"],
    'Gb': ['Gb', "Соль-бемоль мажор", "в тональности Соль-бемоль мажор", "G-Flat Major"],
    'G':  ['G', "Соль мажор", "в тональности Соль мажор", "G Major"],
    'G#': ['G#', "Соль-диез мажор", "в тональности Соль-диез мажор", "G-Sharp Major"],
    'Ab': ['Ab', "Ля-бемоль мажор", "в тональности Ля-бемоль мажор", "A-Flat Major"],
    'A':  ['A', "Ля мажор", "в тональности Ля мажор", "A Major"],
    'A#': ['A#', "Ля-диез мажор", "в тональности Ля-диез мажор", "A-Sharp Major"],
    'Bb': ['Bb', "Си-бемоль мажор", "в тональности Си-бемоль мажор", "B-Flat Major"],
    'B':  ['B', "Си мажор", "в тональности Си мажор", "B Major"],

    # Минор
    'Cm':  ['Cm', "До минор", "в тональности До минор", "C Minor"],
    'C#m': ['C#m', "До-диез минор", "в тональности До-диез минор", "C-Sharp Minor"],
    'Dbm': ['Dbm', "Ре-бемоль минор", "в тональности Ре-бемоль минор", "D-Flat Minor"],
    'Dm':  ['Dm', "Ре минор", "в тональности Ре минор", "D Minor"],
    'D#m': ['D#m', "Ре-диез минор", "в тональности Ре-диез минор", "D-Sharp Minor"],
    'Ebm': ['Ebm', "Ми-бемоль минор", "в тональности Ми-бемоль минор", "E-Flat Minor"],
    'Em':  ['Em', "Ми минор", "в тональности Ми минор", "E Minor"],
    'Fm':  ['Fm', "Фа минор", "в тональности Фа минор", "F Minor"],
    'F#m': ['F#m', "Фа-диез минор", "в тональности Фа-диез минор", "F-Sharp Minor"],
    'Gm':  ['Gm', "Соль минор", "в тональности Соль минор", "G Minor"],
    'G#m': ['G#m', "Соль-диез минор", "в тональности Соль-диез минор", "G-Sharp Minor"],
    'Abm': ['Abm', "Ля-бемоль минор", "в тональности Ля-бемоль минор", "A-Flat Minor"],
    'Am':  ['Am', "Ля минор", "в тональности Ля минор", "A Minor"],
    'A#m': ['A#m', "Ля-диез минор", "в тональности Ля-диез минор", "A-Sharp Minor"],
    'Bbm': ['Bbm', "Си-бемоль минор", "в тональности Си-бемоль минор", "B-Flat Minor"],
    'Bm':  ['Bm', "Си минор", "в тональности Си минор", "B Minor"],

    # --- C (До) ---
    'C Major': ['C', "До мажор", "в тональности До мажор", "C Major", "тональность C"],
    'C Minor': ['Cm', "До минор", "в тональности До минор", "C Minor", "минорная тональность C"],

    'C# Major': ['C#', "До-диез мажор", "в тональности До-диез мажор", "C-Sharp Major"],
    'C# Minor': ['C#m', "До-диез минор", "в тональности До-диез минор", "C-Sharp Minor"],

    'Db Major': ['Db', "Ре-бемоль мажор", "в тональности Ре-бемоль мажор", "D-Flat Major"],
    'Db Minor': ['Dbm', "Ре-бемоль минор", "в тональности Ре-бемоль минор", "D-Flat Minor"],

    # --- D (Ре) ---
    'D Major': ['D', "Ре мажор", "в тональности Ре мажор", "D Major", "тональность D"],
    'D Minor': ['Dm', "Ре минор", "в тональности Ре минор", "D Minor", "минорная тональность D"],

    'D# Major': ['D#', "Ре-диез мажор", "в тональности Ре-диез мажор", "D-Sharp Major"],
    'D# Minor': ['D#m', "Ре-диез минор", "в тональности Ре-диез минор", "D-Sharp Minor"],

    'Eb Major': ['Eb', "Ми-бемоль мажор", "в тональности Ми-бемоль мажор", "E-Flat Major"],
    'Eb Minor': ['Ebm', "Ми-бемоль минор", "в тональности Ми-бемоль минор", "E-Flat Minor"],

    # --- E (Ми) ---
    'E Major': ['E', "Ми мажор", "в тональности Ми мажор", "E Major", "тональность E"],
    'E Minor': ['Em', "Ми минор", "в тональности Ми минор", "E Minor", "минор E"],

    # --- F (Фа) ---
    'F Major': ['F', "Фа мажор", "в тональности Фа мажор", "F Major", "тональность F"],
    'F Minor': ['Fm', "Фа минор", "в тональности Фа минор", "F Minor", "минор F"],

    'F# Major': ['F#', "Фа-диез мажор", "в тональности Фа-диез мажор", "F-Sharp Major"],
    'F# Minor': ['F#m', "Фа-диез минор", "в тональности Фа-диез минор", "F-Sharp Minor"],

    'Gb Major': ['Gbm', "Соль-бемоль мажор", "в тональности Соль-бемоль мажор", "G-Flat Major"],
    # Gb Minor теоретически существует, но на практике почти всегда записывается как F# Minor

    # --- G (Соль) ---
    'G Major': ['G', "Соль мажор", "в тональности Соль мажор", "G Major", "тональность G"],
    'G Minor': ['Gm', "Соль минор", "в тональности Соль минор", "G Minor", "минор G"],

    'G# Major': ['G#', "Соль-диез мажор", "в тональности Соль-диез мажор", "G-Sharp Major"],
    'G# Minor': ['G#m', "Соль-диез минор", "в тональности Соль-диез минор", "G-Sharp Minor"],

    'Ab Major': ['Ab', "Ля-бемоль мажор", "в тональности Ля-бемоль мажор", "A-Flat Major"],
    'Ab Minor': ['Abm', "Ля-бемоль минор", "в тональности Ля-бемоль минор", "A-Flat Minor"],

    # --- A (Ля) ---
    'A Major': ['A', "Ля мажор", "в тональности Ля мажор", "A Major", "тональность A"],
    'A Minor': ['Am', "Ля минор", "в тональности Ля минор", "A Minor", "минор A"],

    'A# Major': ['A#', "Ля-диез мажор", "в тональности Ля-диез мажор", "A-Sharp Major"],
    'A# Minor': ['A#m', "Ля-диез минор", "в тональности Ля-диез минор", "A-Sharp Minor"],

    'Bb Major': ['Bb', "Си-бемоль мажор", "в тональности Си-бемоль мажор", "B-Flat Major"],
    'Bb Minor': ['Bbm', "Си-бемоль минор", "в тональности Си-бемоль минор", "B-Flat Minor"],

    # --- B (Си) ---
    'B Major': ['B', "Си мажор", "в тональности Си мажор", "B Major", "тональность B"],
    'B Minor': ['Bm', "Си минор", "в тональности Си минор", "B Minor", "минор B"],

    #famous_names
    'Bach': ["Бах", "Иоганн Себастьян Бах", "Композитор Бах", "Музыка Баха"],
    'Beatles': ["Битлз", "Группа Beatles", "Песня Битлз"],
    'Beethoven': ["Бетховен", "Людвиг ван Бетховен", "Музыка Бетховена", "Композитор Бетховен"],
    'Brahms': ["Брамс", "Иоганнес Брамс", "Музыка Брамса"],
    'Chopin': ["Шопен", "Фредерик Шопен", "Пьеса Шопена", "Композитор Шопен"],
    'Debussy': ["Дебюсси", "Клод Дебюсси", "Музыка Дебюсси"],
    'Einaudi': ["Эйнауди", "Людовико Эйнауди", "Современная классика Эйнауди"],
    'Ellington': ["Эллингтон", "Дюк Эллингтон", "Джаз Эллингтона"],
    'Evans': ["Эванс", "Билл Эванс", "Джаз Билла Эванса"],
    'Gershwin': ["Гершвин", "Джордж Гершвин", "Музыка Гершвина"],
    'Grieg': ["Григ", "Эдвард Григ", "Пьеса Грига"],
    'Handel': ["Гендель", "Георг Фридрих Гендель", "Музыка Генделя"],
    'Haydn': ["Гайдн", "Йозеф Гайдн", "Симфонии Гайдна"],
    'Hisaishi': ["Хисаиси", "Джо Хисаиси", "Музыка из аниме Хисаиси"],
    'Joplin': ["Джоплин", "Скотт Джоплин", "Рэгтайм Джоплина"],
    'Liszt': ["Лист", "Ференц Лист", "Виртуозная музыка Листа"],
    'Mendelssohn': ["Мендельсон", "Феликс Мендельсон", "Музыка Мендельсона"],
    'Mozart': ["Моцарт", "Вольфганг Амадей Моцарт", "Гений Моцарта", "Музыка Моцарта"],
    'Peterson': ["Питерсон", "Оскар Питерсон", "Джаз Питерсона"],
    'Prokofiev': ["Прокофьев", "Сергей Прокофьев", "Музыка Прокофьева"],
    'Queen': ["Queen", "Группа Queen", "Рок Queen"],
    'Rachmaninoff': ["Рахманинов", "Сергей Рахманинов", "Музыка Рахманинова"],
    'Ravel': ["Равель", "Морис Равель", "Музыка Равеля"],
    'Satie': ["Сати", "Эрик Сати", "Минимализм Сати"],
    'Schubert': ["Шуберт", "Франц Шуберт", "Романтизм Шуберта"],
    'Schumann': ["Шуман", "Роберт Шуман", "Музыка Шумана"],
    'Scriabin': ["Скрябин", "Александр Скрябин", "Мистическая музыка Скрябина"],
    'Shostakovich': ["Шостакович", "Дмитрий Шостакович", "Музыка Шостаковича"],
    'Tchaikovsky': ["Чайковский", "Пётр Ильич Чайковский", "Балеты Чайковского", "Музыка Чайковского"],
    'Verdi': ["Верди", "Джузеппе Верди", "Опера Верди"],
    'Vivaldi': ["Вивальди", "Антонио Вивальди", "Музыка Вивальди"],
    'Wagner': ["Вагнер", "Рихард Вагнер", "Опера Вагнера"],
    'Williams': ["Уильямс", "Джон Уильямс", "Киномузыка Уильямса"],
    'Yiruma': ["Йирума", "Музыка Йирумы"],
    'Zimmer': ["Циммер", "Ханс Циммер", "Эпическая музыка Циммера"],

    #acoustic
    'Tempo_Slow': ["Медленный темп", "Спокойная скорость", "Неторопливое исполнение", "Медленно"],
    "Tempo_Normal": ["Нормальный темп", "Средняя скорость", "Умеренный ритм", "Обычный темп"],
    "Tempo_Fast": ["Быстрый темп", "Скоростное исполнение", "Энергично", "Быстро"],
    "Tempo_VeryFast": ["Очень быстрый темп", "Стремительно", "Виртуозная скорость", "Предельно быстро"],
    'Velocity_Pianissimo': ["Очень тихо", "Пианиссимо", "Едва слышно", "Нежное звучание"],
    "Velocity_Piano": ["Тихо", "Пиано", "Мягкое звучание", "Спокойная динамика"],
    "Velocity_MezzoForte": ["Меццо-форте", "Умеренно громко", "Средняя сила", "Насыщенный звук"],
    "Velocity_Forte": ["Громко", "Форте", "Сильное нажатие", "Мощное звучание", "Ярко"],

    "<unk>": ["<unk>"]
}










# styles = {
#     'Ambient': "Эмбиент",
#     'Atonal': "Атональная",
#     'Baroque': ["Стиль барокко", "Песня барокко", "Барокко", "Жанр барокко"],
#     'Blues': "Блюз",
#     'Classical': "Классика",
#     'Contemporary': "Контемпорари",
#     'Folk': "Фолк",
#     'Impressionist': "Импрессионизм",
#     'Jazz': "Джаз",
#     'Modern': "Модерн", # Или "Современная", но Modern в музыке часто как эпоха
#     'Pop': "Поп",
#     'Rag': "Рэг",
#     'Ragtime': "Рэгтайм",
#     'Rock': "Рок",
#     'Romantic': "Романтизм", # Стиль/эпоха обычно "Романтизм", настроение "Романтическая"
#     'Soundtrack': "Саундтрек",
#     'Expressive': "Активное",
#     'Piano': "Пианино",
#     'Performances': "Представление",
#     'Sinfonia': "Синфония",
#     'Invention': "Инвенция",
#     'Moments': "Музыкальные ",
#     "musicaux": "моменты",
#     'English ': "Английская",
#     "Suite": "Сюита",
#     'Courante': "Куранта", # старинный танец
#     'Passepied': "Паспье", # танец
#     'Schottische': "Шоттиш", # танец, похожий на польку
#     'Mélodie': "Мелодия",
# }
#
# forms = {
#     'Bagatelle': "Багатель",
#     'Ballade': "Баллада",
#     'Barcarolle': "Баркарола",
#     'Canon': "Канон",
#     'Concerto': "Концерт",
#     'Etude': "Этюд",
#     'Fantasia': "Фантазия",
#     'Fugue': "Фуга",
#     'Hymn': "Гимн",
#     'Impromptu': "Экспромт",
#     'Intermezzo': "Интермеццо",
#     'Invention': "Инвенция",
#     'Legend': "Легенда",
#     'March': "Марш",
#     'Mazurka': "Мазурка",
#     'Medley': "Попурри",
#     'Minuet': "Менуэт",
#     'Nocturne': "Ноктюрн",
#     'Partita': "Партита",
#     'Piano': "Фортепианная",
#     'Polonaise': "Полонез",
#     'Prelude': "Прелюдия",
#     'Rhapsody': "Рапсодия",
#     'Romance': "Романс",
#     'Rondo': "Рондо",
#     'Scherzo': "Скерцо",
#     'Sonata': "Соната",
#     'Sonatas': 'Сонаты',
#     'Sonatina': "Сонатина",
#     'Sonatine': "Сонатина",
#     'Suite': "Сюита",
#     'Toccata': "Токката",
#     'Valse': "Вальс",
#     'Variation': "Вариация",
#     'Variations': "Вариации",
#     'Waltz': "Вальс"
# }
#
# technical_and_level = {
#     'Advanced': "Продвинутый",
#     'Arrangement': "Аранжировка",
#     'Beginner': "Начинающий",
#     'Cover': "Кавер",
#     "Largo": "Ларго",
#     'Allegro': "Аллегро",
#     'I.': "I.",
#     'II.': "II.",
#     'III.': "III.",
#     'IV.': "IV.",
#     'assai': 'ассаи',
#     'con': "кон",
#     'brio': "брио",
#     'cantabile': "кантабиле",
#     'Adagio': "Адажио",
#     'moto': 'мото',
#     'e': "э",
#     "Rondo.": "Рондо.",
#     'Improvisation': "Импровизация",
#     'Intermediate': "Средний уровень",
#     'Solo': "Соло",
#     'Solo Piano': "Фортепиано соло",
#     'Virtuoso': "Виртуоз",
#     'Prestissimo': "Престиссимо", # очень-очень быстро
#     'Molto allegro': "Молто аллегро", # очень оживленно
#     'Allegretto': "Аллегретто", # умеренно быстро
#     'Andantino': "Андантино", # чуть быстрее, чем анданте
#     'Lento': "Ленто", # медленно
#     'Moderato': "Модерато", # умеренно
#     'Grave': "Граве", # тяжело, очень медленно
#     'Expressive': "Экспрессивно",
#     'Pathetique': "Патетическая",
#     'Appassionata': "Аппассионата",
#     'Pastorale': "Пастораль",
#     'Waldstein': "Вальдштейн", # знаменитая соната
#     'Eroica': "Героическая",
#     'Live': "Живая запись", # важно для "человечности" исполнения
#     'Swing': "Свинг", # для джаза
# }
#
# keys = {
#     # C (До)
#     'C': "C", 'C Major': "C", 'C-Major': "C", 'C#': "C#", 'C-Sharp Major': "C#",
#     'C#M': "C#", 'Cm': "Cm", 'C Minor': "Cm", 'C-Minor': "Cm", 'C#m': "C#m",
#     'C-Sharp Minor': "C#m", 'Db': "Db", 'D-Flat Major': "Db", 'Dbm': "Dbm",
#     'D-Flat Minor': "Dbm",
#
#     # D (Ре)
#     'D': "D", 'D Major': "D", 'D-Major': "D", 'D#': "D#", 'D-Sharp Major': "D#",
#     'D#M': "D#", 'Dm': "Dm", 'D minor': "Dm", 'D-Minor': "Dm", 'D#m': "D#m",
#     'D-Sharp Minor': "D#m", 'Eb': "Eb", 'E-Flat Major': "Eb", 'Ebm': "Ebm",
#     'E-Flat Minor': "Ebm",
#
#     # E (Ми)
#     'E': "E", 'E Major': "E", 'E-Major': "E", 'Em': "Em", 'E Minor': "Em", 'E-Minor': "Em",
#
#     # F (Фа)
#     'F': "F", 'F Major': "F", 'F-Major': "F", 'Fm': "Fm", 'F Minor': "Fm", 'F-Minor': "Fm",
#     'F#': "F#", 'F-Sharp Major': "F#", 'F#M': "F#", 'F#m': "F#m", 'F-Sharp Minor': "F#m",
#     'Gb': "Gb", 'G-Flat Major': "Gb", 'G Flat': "Gb",
#
#     # G (Соль)
#     'G': "G", 'G Major': "G", 'G-Major': "G", 'Gm': "Gm", 'G Minor': "Gm", 'G-Minor': "Gm",
#     'G#': "G#", 'G-Sharp Major': "G#", 'G#M': "G#", 'G#m': "G#m", 'G-Sharp Minor': "G#m",
#     'Ab': "Ab", 'A-Flat Major': "Ab", 'Abm': "Abm", 'A-Flat Minor': "Abm",
#
#     # A (Ля)
#     'A': "A", 'A Major': "A", 'A-Major': "A", 'Am': "Am", 'A minor': "Am", 'A-Minor': "Am",
#     'A#': "A#", 'A-Sharp Major': "A#", 'A#m': "A#m", 'A-Sharp Minor': "A#m",
#     'Bb': "Bb", 'B-Flat Major': "Bb", 'B flat major': "Bb", 'Bbm': "Bbm", 'B-Flat Minor': "Bbm",
#     'B flat minor': "Bbm",
#
#     # B (Си)
#     'B': "B", 'B Major': "B", 'B-Major': "B", 'Bm': "Bm", 'B Minor': "Bm", 'B-Minor': "Bm"
# }
#
# famous_names = {
#     'Bach': "Бах",
#     'Beatles': "Битлз",
#     'Beethoven': "Бетховен",
#     'Brahms': "Брамс",
#     'Chopin': "Шопен",
#     'Debussy': "Дебюсси",
#     'Einaudi': "Эйнауди",
#     'Ellington': "Эллингтон",
#     'Evans': "Эванс",
#     'Gershwin': "Гершвин",
#     'Grieg': "Григ",
#     'Handel': "Гендель",
#     'Haydn': "Гайдн",
#     'Hisaishi': "Хисаиси",
#     'Joplin': "Джоплин",
#     'Liszt': "Лист",
#     'Mendelssohn': "Мендельсон",
#     'Mozart': "Моцарт",
#     'Peterson': "Питерсон",
#     'Prokofiev': "Прокофьев",
#     'Queen': "Queen",
#     'Rachmaninoff': "Рахманинов",
#     'Ravel': "Равель",
#     'Satie': "Сати",
#     'Schubert': "Шуберт",
#     'Schumann': "Шуман",
#     'Scriabin': "Скрябин",
#     'Shostakovich': "Шостакович",
#     'Tchaikovsky': "Чайковский",
#     'Verdi': "Верди",
#     'Vivaldi': "Вивальди",
#     'Wagner': "Вагнер",
#     'Williams': "Уильямс",
#     'Yiruma': "Йирума",
#     'Zimmer': "Циммер"
# }
#
#
# acoustic_meta = {
#     'TempoSlow': "Медленный темп",
#     "TempoNormal": "Нормальный темп",
#     "TempoFast": "Быстрый темп",
#     "TempoVeryFast": "Очень быстрый темп",
#     'Velocity_Pianissimo': "Очень тихо",
#     "Velocity_Piano": "Громкость пиано",
#     "velocityFast": "Средне",
#     "Velocity_MezzoForte": "Меццефорте",
#     "Velocity_Forte": "Очень громко",
# }
#
#
#
#
# # ['A', 'Ab', 'Advanced', 'Am', 'Ambient', 'B','Bach', 'Bb', 'Bbm', 'Beach', 'Beatles', 'Beethoven', 'Beginner', 'Beyer', 'Bizet', 'Blues', 'Bm',  'C', 'C#', 'C#M', 'Classical', 'Clementi', 'Cm', 'Cover', 'D', 'D#M', 'Dance', 'Db', 'Dm', 'E', 'Eb', 'Ebm', 'Em', 'Etude', 'F', 'F#', 'F#M', 'Field', 'Fm', 'Folk', 'Fox', 'G', 'G#M', 'Gb', 'Glass', 'Glinka', 'Gm', 'Hymn', 'Impressionist', 'Improvisation', 'Intermediate', 'Invention', 'Jazz', 'Modern', 'Mozart', 'Park', 'Pop', 'Price', 'Prokofiev', 'Rag', 'Rock', 'Rodgers', 'Rollin', 'Romance', 'Romantic', 'Scherzo', 'Sky', 'Son', 'Sonata', 'Sonatina', 'Sonatine', 'Soundtrack', 'Tchaikovsky', 'Valse', 'Vandall', 'Waltz']
# #
# # genres = {
# #     'classical', 'jazz', 'pop', 'rock', 'modern', 'baroque', 'romantic',
# #     'contemporary', 'ragtime', 'blues', 'soundtrack', 'ambient', 'folk',
# #     'atonal', 'impressionist', 'hymn', 'new age', 'minimalism', 'metal'
# # }
# #
# # # 2. Формы и Типы
# # forms = {
# #     'sonata', 'etude', 'nocturne', 'waltz', 'prelude', 'fugue', 'scherzo',
# #     'ballade', 'invention', 'partita', 'suite', 'polonaise', 'mazurka',
# #     'toccata', 'variation', 'rhapsody', 'march', 'canon', 'fantasia',
# #     'impromptu', 'concerto', 'requiem', 'medley', 'arrangement', 'cover',
# #     'opening', 'ending', 'theme', 'improvisation', 'virtuoso'
# # }
# #
# # # 3. Великие классики (База)
# # classic_composers = {
# #     'bach', 'chopin', 'mozart', 'beethoven', 'liszt', 'rachmaninoff',
# #     'tchaikovsky', 'debussy', 'satie', 'gershwin', 'shostakovich',
# #     'brahms', 'schubert', 'ravel', 'prokofiev', 'scriabin', 'haydn',
# #     'mendelssohn', 'schumann', 'grieg', 'scarlatti', 'vivaldi', 'handel'
# # }
# #
# # # 4. Модерн, Аниме, Игры, Поп (ТО, ЧТО МЫ ЧУТЬ НЕ ЗАБЫЛИ)
# # modern_icons = {
# #     'hisaishi', 'uematsu', 'kondo', 'sakamoto', 'zun', 'tobyfox',  # Япония/Игры
# #     'yiruma', 'einaudi', 'tiersen', 'clayderman', 'winston',  # Неоклассика
# #     'zimmer', 'williams', 'morricone',  # Кино
# #     'queen', 'beatles', 'coldplay', 'elton', 'abba', 'radiohead',  # Поп/Рок
# #     'joplin', 'evans', 'peterson', 'elllington'  # Джаз
# # }
#
#
#
# # ['A', 'Ab', 'Abm', 'Advanced', 'Am', 'Ambient', 'Arrangement', 'Atonal', 'B',
# #  'Bach', 'Bagatelle', 'Ballade', 'Barcarolle', 'Baroque', 'Bb', 'Bbm', 'Beatles',
# #  'Beethoven', 'Beginner', 'Blues', 'Bm', 'Brahms', 'C', 'C#', 'C#M', 'Canon',
# #  'Chopin', 'Classical', 'Cm', 'Concerto', 'Contemporary', 'Cover', 'D', 'D#M',
# #  'Db', 'Dbm', 'Debussy', 'Dm', 'E', 'Eb', 'Ebm', 'Einaudi', 'Ellington', 'Em',
# #  'Etude', 'Evans', 'F', 'F#', 'F#M', 'Fantasia', 'Fm', 'Folk', 'Fugue', 'G', 'G#',
# #  'G#M', 'Gb', 'Gershwin', 'Gm', 'Grieg', 'Handel', 'Haydn', 'Hisaishi', 'Hymn',
# #  'I. Allegro', 'I. Allegro assai', 'I. Allegro con brio', 'I. Largo - Allegro',
# #  'II. Adagio', 'II. Adagio cantabile', 'II. Andante con moto', 'II. Largo e mesto',
# #  'III. Rondo. Allegro', 'IV. Rondo. Allegro', 'Impressionist', 'Impromptu',
# #  'Improvisation', 'Intermediate', 'Intermezzo', 'Invention', 'Jazz', 'Joplin',
# #  'Legend', 'Liszt', 'March', 'Mazurka', 'Medley', 'Mendelssohn', 'Minuet',
# #  'Modern', 'Mozart', 'Nocturne', 'Partita', 'Peterson', 'Piano Sonata',
# #  'Piano_Sonatas', 'Polonaise', 'Pop', 'Prelude', 'Prelude And Fugue',
# #  'Prokofiev', 'Queen', 'Rachmaninoff', 'Rag', 'Ragtime', 'Ravel', 'Rhapsody',
# #  'Rock', 'Romance', 'Romantic', 'Rondo', 'Satie', 'Scherzo', 'Schubert',
# #  'Schumann', 'Scriabin', 'Shostakovich', 'Solo', 'Solo Piano', 'Sonata',
# #  'Sonatina', 'Sonatine', 'Soundtrack', 'Suite', 'Tchaikovsky', 'Toccata',
# #  'Valse', 'Variation', 'Variations', 'Verdi', 'Virtuoso', 'Vivaldi', 'Wagner',
# #  'Waltz', 'Williams', 'Yiruma', 'Zimmer']
#
# #
# # styles = {
# #     'Ambient': "Амбиент",
# #     'Atonal': "",
# #     'Baroque': "Барокко",
# #     'Blues': "Блюз",
# #     'Classical': "Классика",
# #     'Contemporary': "",
# #     'Folk': "Фолк",
# #     'Impressionist': "Импрессионизм",
# #     'Jazz': "Джаз",
# #     'Modern': "Современная",
# #     'Pop': "Поп",
# #     'Rag': "Рэг",
# #     'Ragtime': "",
# #     'Rock': "Рок",
# #     'Romantic': "Романтическая",
# #     'Soundtrack': "Саунтдтрек"
# # }
# #
# # forms = [
# #     'Bagatelle', 'Ballade', 'Barcarolle', 'Canon', 'Concerto', 'Etude',
# #     'Fantasia', 'Fugue', 'Hymn', 'Impromptu', 'Intermezzo', 'Invention',
# #     'Legend', 'March', 'Mazurka', 'Medley', 'Minuet', 'Nocturne', 'Partita',
# #     'Piano Sonata', 'Piano_Sonatas', 'Polonaise', 'Prelude', 'Prelude And Fugue',
# #     'Rhapsody', 'Romance', 'Rondo', 'Scherzo', 'Sonata', 'Sonatina',
# #     'Sonatine', 'Suite', 'Toccata', 'Valse', 'Variation', 'Variations', 'Waltz'
# # ]
# #
# # technical_and_level = [
# #     'Advanced', 'Arrangement', 'Beginner', 'Cover', 'I. Allegro',
# #     'I. Allegro assai', 'I. Allegro con brio', 'I. Largo - Allegro',
# #     'II. Adagio', 'II. Adagio cantabile', 'II. Andante con moto',
# #     'II. Largo e mesto', 'III. Rondo. Allegro', 'IV. Rondo. Allegro',
# #     'Improvisation', 'Intermediate', 'Solo', 'Solo Piano', 'Virtuoso'
# # ]
# #
# # keys = [
# #     'A', 'Ab', 'Abm', 'Am', 'B', 'Bb', 'Bbm', 'Bm', 'C', 'C#', 'C#M', 'Cm',
# #     'D', 'D#M', 'Db', 'Dbm', 'Dm', 'E', 'Eb', 'Ebm', 'Em', 'F', 'F#', 'F#M',
# #     'Fm', 'G', 'G#', 'G#M', 'Gb', 'Gm'
# # ]
# #
# #
# # famous_names = [
# #     'Bach', 'Beatles', 'Beethoven', 'Brahms', 'Chopin', 'Debussy', 'Einaudi',
# #     'Ellington', 'Evans', 'Gershwin', 'Grieg', 'Handel', 'Haydn', 'Hisaishi',
# #     'Joplin', 'Liszt', 'Mendelssohn', 'Mozart', 'Peterson', 'Prokofiev',
# #     'Queen', 'Rachmaninoff', 'Ravel', 'Satie', 'Schubert', 'Schumann',
# #     'Scriabin', 'Shostakovich', 'Tchaikovsky', 'Verdi', 'Vivaldi', 'Wagner',
# #     'Williams', 'Yiruma', 'Zimmer'
# # ]
#
